{
  "char_to_idx": {
    "<SOS>": 0,
    "<EOS>": 1,
    "<PAD>": 2,
    "<UNK>": 3,
    " ": 4,
    "!": 5,
    "\"": 209,
    "#": 7,
    "$": 8,
    "%": 9,
    "&": 10,
    "'": 11,
    "(": 12,
    ")": 13,
    "*": 14,
    "+": 15,
    ",": 16,
    "-": 17,
    ".": 18,
    "/": 19,
    "0": 20,
    "1": 21,
    "2": 22,
    "3": 23,
    "4": 24,
    "5": 25,
    "6": 26,
    "7": 27,
    "8": 28,
    "9": 29,
    ":": 30,
    ";": 31,
    "<": 32,
    "=": 33,
    ">": 34,
    "?": 35,
    "@": 36,
    "A": 37,
    "B": 38,
    "C": 39,
    "D": 40,
    "E": 41,
    "F": 42,
    "G": 43,
    "H": 44,
    "I": 45,
    "J": 46,
    "K": 47,
    "L": 48,
    "M": 49,
    "N": 50,
    "O": 51,
    "P": 52,
    "Q": 53,
    "R": 54,
    "S": 55,
    "T": 56,
    "U": 57,
    "V": 58,
    "W": 59,
    "X": 60,
    "Y": 61,
    "Z": 62,
    "[": 63,
    "\\": 64,
    "]": 65,
    "^": 66,
    "_": 67,
    "`": 68,
    "a": 69,
    "b": 70,
    "c": 71,
    "d": 72,
    "e": 73,
    "f": 74,
    "g": 75,
    "h": 76,
    "i": 77,
    "j": 78,
    "k": 79,
    "l": 80,
    "m": 81,
    "n": 82,
    "o": 83,
    "p": 84,
    "q": 85,
    "r": 86,
    "s": 87,
    "t": 88,
    "u": 89,
    "v": 90,
    "w": 91,
    "x": 92,
    "y": 93,
    "z": 94,
    "{": 95,
    "|": 96,
    "}": 97,
    "~": 98,
    "\t": 99,
    "\n": 100,
    "\r": 101,
    "\f": 102,
    "\u000b": 103,
    "¡": 104,
    "¢": 105,
    "£": 106,
    "¤": 107,
    "¥": 108,
    "¦": 109,
    "§": 110,
    "¨": 111,
    "©": 112,
    "ª": 113,
    "«": 114,
    "¬": 115,
    "®": 116,
    "¯": 117,
    "°": 118,
    "±": 119,
    "²": 120,
    "³": 121,
    "´": 122,
    "µ": 123,
    "¶": 124,
    "·": 125,
    "¸": 126,
    "¹": 127,
    "º": 128,
    "»": 129,
    "¼": 130,
    "½": 131,
    "¾": 132,
    "¿": 133,
    "À": 134,
    "Á": 135,
    "Â": 136,
    "Ã": 137,
    "Ä": 138,
    "Å": 139,
    "Æ": 140,
    "Ç": 141,
    "È": 142,
    "É": 143,
    "Ê": 144,
    "Ë": 145,
    "Ì": 146,
    "Í": 147,
    "Î": 148,
    "Ï": 149,
    "Ð": 150,
    "Ñ": 151,
    "Ò": 152,
    "Ó": 153,
    "Ô": 154,
    "Õ": 155,
    "Ö": 156,
    "×": 157,
    "Ø": 158,
    "Ù": 159,
    "Ú": 160,
    "Û": 161,
    "Ü": 162,
    "Ý": 163,
    "Þ": 164,
    "ß": 165,
    "à": 166,
    "á": 167,
    "â": 168,
    "ã": 169,
    "ä": 170,
    "å": 171,
    "æ": 172,
    "ç": 173,
    "è": 174,
    "é": 175,
    "ê": 176,
    "ë": 177,
    "ì": 178,
    "í": 179,
    "î": 180,
    "ï": 181,
    "ð": 182,
    "ñ": 183,
    "ò": 184,
    "ó": 185,
    "ô": 186,
    "õ": 187,
    "ö": 188,
    "÷": 189,
    "ø": 190,
    "ù": 191,
    "ú": 192,
    "û": 193,
    "ü": 194,
    "ý": 195,
    "þ": 196,
    "ÿ": 197,
    " ": 198,
    "​": 199,
    "‌": 200,
    "‍": 201,
    "﻿": 202,
    "⁠": 203,
    "…": 204,
    "–": 205,
    "—": 206,
    ", ": 207,
    "•": 210,
    "‰": 211,
    "‹": 212,
    "›": 213,
    "Š": 214,
    "š": 215,
    "Ž": 216,
    "ž": 217,
    "Œ": 218,
    "œ": 219,
    "Ÿ": 220,
    "ƒ": 221,
    "ˆ": 222,
    "˜": 223,
    "€": 224,
    "™": 225,
    "∞": 226,
    "≠": 227,
    "≤": 228,
    "≥": 229,
    "∂": 230,
    "∆": 231,
    "∇": 232,
    "∏": 233,
    "∑": 234,
    "∫": 235,
    "π": 236,
    "Ω": 237,
    "α": 238,
    "β": 239,
    "γ": 240,
    "δ": 241,
    "ε": 242,
    "ζ": 243,
    "η": 244,
    "θ": 245,
    "λ": 246,
    "μ": 247,
    "ξ": 248,
    "ρ": 249,
    "σ": 250,
    "τ": 251,
    "φ": 252,
    "χ": 253,
    "ψ": 254,
    "ω": 255
  },
  "idx_to_char": {
    "0": "<SOS>",
    "1": "<EOS>",
    "2": "<PAD>",
    "3": "<UNK>",
    "4": " ",
    "5": "!",
    "6": "\"",
    "7": "#",
    "8": "$",
    "9": "%",
    "10": "&",
    "11": "'",
    "12": "(",
    "13": ")",
    "14": "*",
    "15": "+",
    "16": ",",
    "17": "-",
    "18": ".",
    "19": "/",
    "20": "0",
    "21": "1",
    "22": "2",
    "23": "3",
    "24": "4",
    "25": "5",
    "26": "6",
    "27": "7",
    "28": "8",
    "29": "9",
    "30": ":",
    "31": ";",
    "32": "<",
    "33": "=",
    "34": ">",
    "35": "?",
    "36": "@",
    "37": "A",
    "38": "B",
    "39": "C",
    "40": "D",
    "41": "E",
    "42": "F",
    "43": "G",
    "44": "H",
    "45": "I",
    "46": "J",
    "47": "K",
    "48": "L",
    "49": "M",
    "50": "N",
    "51": "O",
    "52": "P",
    "53": "Q",
    "54": "R",
    "55": "S",
    "56": "T",
    "57": "U",
    "58": "V",
    "59": "W",
    "60": "X",
    "61": "Y",
    "62": "Z",
    "63": "[",
    "64": "\\",
    "65": "]",
    "66": "^",
    "67": "_",
    "68": "`",
    "69": "a",
    "70": "b",
    "71": "c",
    "72": "d",
    "73": "e",
    "74": "f",
    "75": "g",
    "76": "h",
    "77": "i",
    "78": "j",
    "79": "k",
    "80": "l",
    "81": "m",
    "82": "n",
    "83": "o",
    "84": "p",
    "85": "q",
    "86": "r",
    "87": "s",
    "88": "t",
    "89": "u",
    "90": "v",
    "91": "w",
    "92": "x",
    "93": "y",
    "94": "z",
    "95": "{",
    "96": "|",
    "97": "}",
    "98": "~",
    "99": "\t",
    "100": "\n",
    "101": "\r",
    "102": "\f",
    "103": "\u000b",
    "104": "¡",
    "105": "¢",
    "106": "£",
    "107": "¤",
    "108": "¥",
    "109": "¦",
    "110": "§",
    "111": "¨",
    "112": "©",
    "113": "ª",
    "114": "«",
    "115": "¬",
    "116": "®",
    "117": "¯",
    "118": "°",
    "119": "±",
    "120": "²",
    "121": "³",
    "122": "´",
    "123": "µ",
    "124": "¶",
    "125": "·",
    "126": "¸",
    "127": "¹",
    "128": "º",
    "129": "»",
    "130": "¼",
    "131": "½",
    "132": "¾",
    "133": "¿",
    "134": "À",
    "135": "Á",
    "136": "Â",
    "137": "Ã",
    "138": "Ä",
    "139": "Å",
    "140": "Æ",
    "141": "Ç",
    "142": "È",
    "143": "É",
    "144": "Ê",
    "145": "Ë",
    "146": "Ì",
    "147": "Í",
    "148": "Î",
    "149": "Ï",
    "150": "Ð",
    "151": "Ñ",
    "152": "Ò",
    "153": "Ó",
    "154": "Ô",
    "155": "Õ",
    "156": "Ö",
    "157": "×",
    "158": "Ø",
    "159": "Ù",
    "160": "Ú",
    "161": "Û",
    "162": "Ü",
    "163": "Ý",
    "164": "Þ",
    "165": "ß",
    "166": "à",
    "167": "á",
    "168": "â",
    "169": "ã",
    "170": "ä",
    "171": "å",
    "172": "æ",
    "173": "ç",
    "174": "è",
    "175": "é",
    "176": "ê",
    "177": "ë",
    "178": "ì",
    "179": "í",
    "180": "î",
    "181": "ï",
    "182": "ð",
    "183": "ñ",
    "184": "ò",
    "185": "ó",
    "186": "ô",
    "187": "õ",
    "188": "ö",
    "189": "÷",
    "190": "ø",
    "191": "ù",
    "192": "ú",
    "193": "û",
    "194": "ü",
    "195": "ý",
    "196": "þ",
    "197": "ÿ",
    "198": " ",
    "199": "​",
    "200": "‌",
    "201": "‍",
    "202": "﻿",
    "203": "⁠",
    "204": "…",
    "205": "–",
    "206": "—",
    "207": ", ",
    "208": "\"",
    "209": "\"",
    "210": "•",
    "211": "‰",
    "212": "‹",
    "213": "›",
    "214": "Š",
    "215": "š",
    "216": "Ž",
    "217": "ž",
    "218": "Œ",
    "219": "œ",
    "220": "Ÿ",
    "221": "ƒ",
    "222": "ˆ",
    "223": "˜",
    "224": "€",
    "225": "™",
    "226": "∞",
    "227": "≠",
    "228": "≤",
    "229": "≥",
    "230": "∂",
    "231": "∆",
    "232": "∇",
    "233": "∏",
    "234": "∑",
    "235": "∫",
    "236": "π",
    "237": "Ω",
    "238": "α",
    "239": "β",
    "240": "γ",
    "241": "δ",
    "242": "ε",
    "243": "ζ",
    "244": "η",
    "245": "θ",
    "246": "λ",
    "247": "μ",
    "248": "ξ",
    "249": "ρ",
    "250": "σ",
    "251": "τ",
    "252": "φ",
    "253": "χ",
    "254": "ψ",
    "255": "ω"
  },
  "special_tokens": {
    "<SOS>": 0,
    "<EOS>": 1,
    "<PAD>": 2,
    "<UNK>": 3
  },
  "vocab_size": 254,
  "max_length": 150,
  "stats": {
    "vocab_size": 254,
    "special_tokens": {
      "<SOS>": 0,
      "<EOS>": 1,
      "<PAD>": 2,
      "<UNK>": 3
    },
    "extended_mode": true,
    "char_frequency": {
      "1": 317362,
      "X": 183693,
      "E": 21985,
      "N": 21513,
      "C": 21248,
      "T": 20790,
      "I": 20473,
      "J": 19804,
      "e": 6483,
      "t": 6429,
      " ": 5918,
      ",": 5511,
      "o": 4006,
      "a": 3997,
      "n": 3760,
      "r": 3476,
      "s": 3122,
      "i": 3119,
      "l": 3000,
      ">": 2642,
      "<": 2597,
      ")": 2538,
      "(": 2519,
      "\"": 2407,
      "d": 2166,
      "0": 2103,
      "/": 2030,
      "=": 2004,
      "L": 1885,
      "c": 1745,
      "A": 1610,
      "2": 1571,
      "R": 1533,
      "m": 1483,
      "'": 1463,
      "p": 1352,
      "u": 1290,
      "5": 1272,
      "S": 1169,
      "x": 1117,
      "b": 1045,
      "g": 1003,
      "-": 968,
      "8": 958,
      "f": 939,
      "y": 866,
      "O": 857,
      "H": 837,
      "6": 830,
      "U": 771
    },
    "uncovered_count": 3
  }
}